bun.org
#+TITLE: Bun Loom: DotCortex
#+DESCRIPTION: Bun and Bunx package manifests
#+AUTHOR: Metsatron
#+LANGUAGE: en
#+PROPERTY: header-args :mkdirp yes :results silent
#+PROPERTY: header-args:bash :comments both
#+PROPERTY: header-args:makefile :comments no :padline no

* Bun manifest
Global Bun packages installed with =bun add -g=.
The manifest lives in a DotCortex-owned data path so =~/.bun= and =~/.bunx=
can stay real Bun homes instead of repo symlinks.
Columns: PKG VERSION FLAGS REGISTRY EXTRA
Leave VERSION empty to treat the currently installed version as canonical.

#+BEGIN_SRC text :tangle all/.local/share/dotcortex/manifests/bun/global.ssv
# ~/DotCortex/all/.local/share/dotcortex/manifests/bun/global.ssv
# PKG VERSION FLAGS REGISTRY EXTRA
#+END_SRC

* Isolated Bun env for DotCortex
#+BEGIN_SRC bash :tangle all/.local/bin/dotcortex-bun-env :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/dotcortex-bun-env
set -euo pipefail

export BUN_INSTALL="${BUN_INSTALL:-$HOME/.bun}"
export BUN_GLOBAL_DIR="${BUN_GLOBAL_DIR:-$BUN_INSTALL/install/global}"
export BUN_GLOBAL_BIN_DIR="${BUN_GLOBAL_BIN_DIR:-$BUN_INSTALL/bin}"
export PATH="$BUN_GLOBAL_BIN_DIR:$PATH"

if ! command -v bun >/dev/null 2>&1; then
  if ! command -v curl >/dev/null 2>&1; then
    echo "curl is required to install Bun" >&2
    exit 1
  fi
  curl -fsSL https://bun.com/install | bash
  export PATH="$BUN_GLOBAL_BIN_DIR:$PATH"
fi

exec "$@"
#+END_SRC

* Capture current global Bun -> manifest
#+BEGIN_SRC bash :tangle all/.local/bin/bun-capture :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/bun-capture
set -euo pipefail

MAN="$HOME/DotCortex/all/.local/share/dotcortex/manifests/bun/global.ssv"
RUN="$HOME/.local/bin/dotcortex-bun-env"

mkdir -p "$(dirname "$MAN")"
touch "$MAN"

tmp_existing="$(mktemp)"
tmp_have="$(mktemp)"
tmp_new="$(mktemp)"

awk '!/^[[:space:]]*#/ && NF { print $1 }' "$MAN" | sort -u >"$tmp_existing"

"$RUN" python3 - <<'PY' | sort -u >"$tmp_have"
import json
import os
import sys

root = os.path.expanduser(os.environ.get("BUN_GLOBAL_DIR", "~/.bun/install/global"))
node_modules = os.path.join(root, "node_modules")

def emit(pkg_dir):
    pkg_json = os.path.join(pkg_dir, "package.json")
    if not os.path.isfile(pkg_json):
        return
    try:
        with open(pkg_json, "r", encoding="utf-8") as fh:
            data = json.load(fh)
    except Exception:
        return
    name = data.get("name")
    if name:
        print(name)

if os.path.isdir(node_modules):
    for entry in sorted(os.listdir(node_modules)):
        path = os.path.join(node_modules, entry)
        if entry.startswith("@") and os.path.isdir(path):
            for sub in sorted(os.listdir(path)):
                emit(os.path.join(path, sub))
        elif os.path.isdir(path):
            emit(path)
PY

comm -13 "$tmp_existing" "$tmp_have" >"$tmp_new"

rm -f "$tmp_existing" "$tmp_have"

if [ ! -s "$tmp_new" ]; then
  rm -f "$tmp_new"
  echo "No new Bun globals to capture into $MAN"
  exit 0
fi

while read -r pkg; do
  [ -n "$pkg" ] || continue
  printf '%s "" "" "" ""\n' "$pkg" >>"$MAN"
done <"$tmp_new"

rm -f "$tmp_new"
echo "Updated $MAN"
#+END_SRC

* Plan diff
#+BEGIN_SRC bash :tangle all/.local/bin/bun-diff :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/bun-diff
set -euo pipefail

MAN="$HOME/DotCortex/all/.local/share/dotcortex/manifests/bun/global.ssv"
RUN="$HOME/.local/bin/dotcortex-bun-env"

tmp_want="$(mktemp)"
tmp_have="$(mktemp)"

awk '!/^[[:space:]]*#/ && NF { print $1 }' "$MAN" | sort -u >"$tmp_want"

"$RUN" python3 - <<'PY' | sort -u >"$tmp_have"
import json
import os

root = os.path.expanduser(os.environ.get("BUN_GLOBAL_DIR", "~/.bun/install/global"))
node_modules = os.path.join(root, "node_modules")

def emit(pkg_dir):
    pkg_json = os.path.join(pkg_dir, "package.json")
    if not os.path.isfile(pkg_json):
        return
    try:
        with open(pkg_json, "r", encoding="utf-8") as fh:
            data = json.load(fh)
    except Exception:
        return
    name = data.get("name")
    if name:
        print(name)

if os.path.isdir(node_modules):
    for entry in sorted(os.listdir(node_modules)):
        path = os.path.join(node_modules, entry)
        if entry.startswith("@") and os.path.isdir(path):
            for sub in sorted(os.listdir(path)):
                emit(os.path.join(path, sub))
        elif os.path.isdir(path):
            emit(path)
PY

echo "== bun plan =="
echo "[to install]"
comm -23 "$tmp_want" "$tmp_have" | sed 's/^/  + /'

echo "[to uninstall]"
comm -13 "$tmp_want" "$tmp_have" | sed 's/^/  - /'

rm -f "$tmp_want" "$tmp_have"
#+END_SRC

