all/.local/bin/bun-capture
#!/usr/bin/env bash
# Capture current global Bun -> manifest

# [[file:../../../bun.org::*Capture current global Bun -> manifest][Capture current global Bun -> manifest:1]]
# ~/DotCortex/all/.local/bin/bun-capture
set -euo pipefail

MAN="$HOME/DotCortex/all/.local/share/dotcortex/manifests/bun/global.ssv"
RUN="$HOME/.local/bin/dotcortex-bun-env"

mkdir -p "$(dirname "$MAN")"
touch "$MAN"

tmp_existing="$(mktemp)"
tmp_have="$(mktemp)"
tmp_new="$(mktemp)"

awk '!/^[[:space:]]*#/ && NF { print $1 }' "$MAN" | sort -u >"$tmp_existing"

"$RUN" python3 - <<'PY' | sort -u >"$tmp_have"
import json
import os
import sys

root = os.path.expanduser(os.environ.get("BUN_GLOBAL_DIR", "~/.bun/install/global"))
node_modules = os.path.join(root, "node_modules")

def emit(pkg_dir):
    pkg_json = os.path.join(pkg_dir, "package.json")
    if not os.path.isfile(pkg_json):
        return
    try:
        with open(pkg_json, "r", encoding="utf-8") as fh:
            data = json.load(fh)
    except Exception:
        return
    name = data.get("name")
    if name:
        print(name)

if os.path.isdir(node_modules):
    for entry in sorted(os.listdir(node_modules)):
        path = os.path.join(node_modules, entry)
        if entry.startswith("@") and os.path.isdir(path):
            for sub in sorted(os.listdir(path)):
                emit(os.path.join(path, sub))
        elif os.path.isdir(path):
            emit(path)
PY

comm -13 "$tmp_existing" "$tmp_have" >"$tmp_new"

rm -f "$tmp_existing" "$tmp_have"

if [ ! -s "$tmp_new" ]; then
  rm -f "$tmp_new"
  echo "No new Bun globals to capture into $MAN"
  exit 0
fi

while read -r pkg; do
  [ -n "$pkg" ] || continue
  printf '%s "" "" "" ""\n' "$pkg" >>"$MAN"
done <"$tmp_new"

rm -f "$tmp_new"
echo "Updated $MAN"
# Capture current global Bun -> manifest:1 ends here
