all/.local/bin/dotcortex-bun-env
#!/usr/bin/env bash
# Isolated Bun env for DotCortex

# [[file:../../../bun.org::*Isolated Bun env for DotCortex][Isolated Bun env for DotCortex:1]]
# ~/DotCortex/all/.local/bin/dotcortex-bun-env
set -euo pipefail

export BUN_INSTALL="${BUN_INSTALL:-$HOME/.bun}"
export BUN_GLOBAL_DIR="${BUN_GLOBAL_DIR:-$BUN_INSTALL/install/global}"
export BUN_GLOBAL_BIN_DIR="${BUN_GLOBAL_BIN_DIR:-$BUN_INSTALL/bin}"
export PATH="$BUN_GLOBAL_BIN_DIR:$PATH"

if ! command -v bun >/dev/null 2>&1; then
  if ! command -v curl >/dev/null 2>&1; then
    echo "curl is required to install Bun" >&2
    exit 1
  fi
  curl -fsSL https://bun.com/install | bash
  export PATH="$BUN_GLOBAL_BIN_DIR:$PATH"
fi

exec "$@"
# Isolated Bun env for DotCortex:1 ends here
