bun.org
* Apply manifest inside DotCortex env
#+BEGIN_SRC bash :tangle all/.local/bin/bun-apply :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/bun-apply
set -euo pipefail

MAN="$HOME/DotCortex/all/.local/share/dotcortex/manifests/bun/global.ssv"
RUN="$HOME/.local/bin/dotcortex-bun-env"

ENFORCE="${ENFORCE:-1}"
UNINSTALL="${UNINSTALL:-1}"
UPDATE="${UPDATE:-0}"

echo "== bun apply =="

_emit_norm() {
  awk -v FS='[ \t]+' '
    function dequote(s){ return (s=="\"\"" ? "" : s) }
    $0 ~ /^[ \t]*#/ || NF==0 { next }
    {
      printf "%s|%s|%s|%s|%s\n",
        dequote($1),dequote($2),dequote($3),dequote($4),dequote($5)
    }
  ' "$MAN"
}

declare -A live_ver

while read -r name ver; do
  [ -n "${name:-}" ] || continue
  live_ver["$name"]="$ver"
done < <("$RUN" python3 - <<'PY'
import json
import os

root = os.path.expanduser(os.environ.get("BUN_GLOBAL_DIR", "~/.bun/install/global"))
node_modules = os.path.join(root, "node_modules")

def emit(pkg_dir):
    pkg_json = os.path.join(pkg_dir, "package.json")
    if not os.path.isfile(pkg_json):
        return
    try:
        with open(pkg_json, "r", encoding="utf-8") as fh:
            data = json.load(fh)
    except Exception:
        return
    name = data.get("name")
    version = data.get("version", "")
    if name:
        print(f"{name} {version}")

if os.path.isdir(node_modules):
    for entry in sorted(os.listdir(node_modules)):
        path = os.path.join(node_modules, entry)
        if entry.startswith("@") and os.path.isdir(path):
            for sub in sorted(os.listdir(path)):
                emit(os.path.join(path, sub))
        elif os.path.isdir(path):
            emit(path)
PY
)

declare -A want_names

while IFS='|' read -r pkg version flags registry extra
do
  [ -n "$pkg" ] || continue
  want_names["$pkg"]=1

  installed_ver="${live_ver[$pkg]:-}"
  if [ -n "$installed_ver" ] && [ "$UPDATE" != "1" ]; then
    continue
  fi

  if [ -n "$installed_ver" ] && [ -n "$version" ] && [ "$version" = "$installed_ver" ]; then
    continue
  fi

  spec="$pkg"
  if [ -n "$version" ]; then
    spec="$pkg@$version"
  fi

  args=(add -g "$spec")

  if [ -n "$flags" ]; then
    IFS=',' read -ra FF <<<"$flags"
    for f in "${FF[@]}"; do
      [ -n "$f" ] && args+=("$f")
    done
  fi

  if [ -n "$registry" ]; then
    args+=(--registry "$registry")
  fi

  "$RUN" bun "${args[@]}"
done < <(_emit_norm)

if [ "$ENFORCE" = "1" ] && [ "$UNINSTALL" = "1" ]; then
  echo "== uninstall extras =="
  for pkg in $(printf '%s\n' "${!live_ver[@]}" | sort); do
    if [ -z "${want_names[$pkg]:-}" ]; then
      "$RUN" bun remove -g "$pkg" || true
    fi
  done
fi

if [ -x "$HOME/.local/bin/dotcortex-bun-build-lib" ]; then
  # Source-build rows are processed in the same pass so updates and installs stay sequential.
  # The build fingerprints suppress reruns when the checkout and commands are unchanged.
  source "$HOME/.local/bin/dotcortex-bun-build-lib"

  echo "== bun build pass =="

  seen_build=0
  while IFS=$'\t' read -r name mode root repo ref subdir install_cmd build_cmd health_cmd extra
  do
    [ -n "$name" ] || continue
    if [ -n "$BUN_BUILD_ONLY" ] && [ "$name" != "$BUN_BUILD_ONLY" ]; then
      continue
    fi

    seen_build=1
    bun_build_ensure_checkout "$UPDATE" "$name" "$mode" "$root" "$repo" "$ref"

    root_abs="$(bun_build_root_abs "$root")"
    workdir_abs="$(bun_build_workdir_abs "$root" "$subdir")"
    state_dir="$(bun_build_state_dir "$name")"
    install_stamp="$state_dir/install.fp"
    build_stamp="$state_dir/build.fp"

    install_effective="$(bun_build_effective_install_cmd "$root_abs" "$workdir_abs" "$install_cmd")"
    build_effective="$(bun_build_effective_build_cmd "$build_cmd")"

    if [ -n "$install_effective" ]; then
      install_fp="$(bun_build_install_fingerprint "$root_abs" "$workdir_abs" "$install_effective")"
      if bun_build_fingerprint_matches "$install_stamp" "$install_fp"; then
        echo ">> [$name] install current"
      else
        bun_build_run_step "$name" install "$workdir_abs" "$install_effective"
        bun_build_write_fingerprint "$install_stamp" "$install_fp"
      fi
    else
      echo ">> [$name] install disabled"
    fi

    if [ -n "$build_effective" ]; then
      build_fp="$(bun_build_build_fingerprint "$root_abs" "$workdir_abs" "$install_effective" "$build_effective")"
      if bun_build_fingerprint_matches "$build_stamp" "$build_fp"; then
        echo ">> [$name] build current"
      else
        bun_build_run_step "$name" build "$workdir_abs" "$build_effective"
        bun_build_write_fingerprint "$build_stamp" "$build_fp"
      fi
    else
      echo ">> [$name] build disabled"
    fi
  done < <(bun_build_rows)

  if [ "$seen_build" = "0" ]; then
    echo "No Bun builds defined in $BUN_BUILD_MANIFEST"
  fi
fi

echo "Done."
#+END_SRC

* Health
#+BEGIN_SRC bash :tangle all/.local/bin/bun-health :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/bun-health
set -euo pipefail

"$HOME/.local/bin/dotcortex-bun-env" bash -c '
echo "BUN       = $(command -v bun || echo missing)"
echo "BUNX      = $(command -v bunx || echo missing)"
echo "bun ver   = $(bun --version 2>/dev/null || echo n/a)"
echo "BUN_INSTALL=${BUN_INSTALL:-}"
echo "BUN_GLOBAL_DIR=${BUN_GLOBAL_DIR:-}"
echo "BUN_GLOBAL_BIN_DIR=${BUN_GLOBAL_BIN_DIR:-}"
echo "Global packages: $(python3 - <<"PY"
import json
import os

root = os.path.expanduser(os.environ.get("BUN_GLOBAL_DIR", "~/.bun/install/global"))
node_modules = os.path.join(root, "node_modules")
count = 0
if os.path.isdir(node_modules):
    for entry in os.listdir(node_modules):
        path = os.path.join(node_modules, entry)
        if entry.startswith("@") and os.path.isdir(path):
            count += sum(1 for sub in os.listdir(path) if os.path.isdir(os.path.join(path, sub)))
        elif os.path.isdir(path):
            count += 1
print(count)
PY
)"
'
#+END_SRC

* Bun build manifest
Use this lane for Bun-managed source trees that need a checkout plus conditional
install/build steps rather than a simple =bun add -g=. These rows are applied
sequentially by =bun:apply= after the global Bun package pass.

- =MODE=submodule= expects =ROOT= to already exist in =.gitmodules=
- =MODE=git= clones or syncs a standalone checkout at =ROOT=
- =MODE=local= uses an already-present tree and never pulls it forward
- =INSTALL=: empty = auto (=bun install --frozen-lockfile= when a Bun lockfile exists,
  else =bun install=); =none= disables dependency install
- =BUILD=: empty or =none= skips builds
- =HEALTH=: optional command, only executed when =RUN_CHECKS=1 bun-health=
- Quote commands that contain spaces

#+BEGIN_SRC text :tangle all/.local/share/dotcortex/manifests/bun/build.ssv
# ~/DotCortex/all/.local/share/dotcortex/manifests/bun/build.ssv
# NAME MODE ROOT REPO REF SUBDIR INSTALL BUILD HEALTH EXTRA
# maestro submodule vendor/agent-maestro https://github.com/subhangR/agent-maestro.git main . "" "bun run build:all" "" ""
codex-desktop-linux git ~/.local/share/dotcortex/src/codex-desktop-linux https://github.com/ilysenko/codex-desktop-linux.git main . "./install.sh" "python3 -c 'from pathlib import Path; import re; p=Path(\"codex-app/start.sh\"); text=p.read_text(); repl=\"SCRIPT_DIR=\\\"$(cd \\\"$(dirname \\\"$(readlink -f \\\"${BASH_SOURCE[0]:-$0}\\\")\\\")\\\" && pwd -P)\\\"\"; text=re.sub(r\"^SCRIPT_DIR=.*$\", repl, text, count=1, flags=re.M); p.write_text(text)' && mkdir -p \"$HOME/.local/share/applications\" \"$HOME/.local/share/icons/hicolor/256x256/apps\" && ln -sf \"$PWD/assets/codex.png\" \"$HOME/.local/share/icons/hicolor/256x256/apps/codex-desktop.png\" && printf '%s\n' '[Desktop Entry]' 'Name=Codex Desktop' 'Comment=OpenAI Codex desktop app' \"Exec=env PATH=$HOME/.npm-global/bin:$HOME/.local/bin:/usr/local/bin:/usr/bin:/bin $HOME/.local/bin/codex-desktop\" 'Icon=codex-desktop' 'Terminal=false' 'Type=Application' 'Categories=Development;Chat;' 'StartupWMClass=codex-desktop' 'X-GNOME-WMClass=codex-desktop' > \"$HOME/.local/share/applications/codex-desktop.desktop\" && command -v update-desktop-database >/dev/null 2>&1 && update-desktop-database \"$HOME/.local/share/applications\" >/dev/null 2>&1 || true" ""
#+END_SRC

