all/.local/bin/bun-apply
#!/usr/bin/env bash
# Apply manifest inside DotCortex env

# [[file:../../../bun.org::*Apply manifest inside DotCortex env][Apply manifest inside DotCortex env:1]]
# ~/DotCortex/all/.local/bin/bun-apply
set -euo pipefail

MAN="$HOME/DotCortex/all/.local/share/dotcortex/manifests/bun/global.ssv"
RUN="$HOME/.local/bin/dotcortex-bun-env"

ENFORCE="${ENFORCE:-1}"
UNINSTALL="${UNINSTALL:-1}"
UPDATE="${UPDATE:-0}"

echo "== bun apply =="

_emit_norm() {
  awk -v FS='[ \t]+' '
    function dequote(s){ return (s=="\"\"" ? "" : s) }
    $0 ~ /^[ \t]*#/ || NF==0 { next }
    {
      printf "%s|%s|%s|%s|%s\n",
        dequote($1),dequote($2),dequote($3),dequote($4),dequote($5)
    }
  ' "$MAN"
}

declare -A live_ver

while read -r name ver; do
  [ -n "${name:-}" ] || continue
  live_ver["$name"]="$ver"
done < <("$RUN" python3 - <<'PY'
import json
import os

root = os.path.expanduser(os.environ.get("BUN_GLOBAL_DIR", "~/.bun/install/global"))
node_modules = os.path.join(root, "node_modules")

def emit(pkg_dir):
    pkg_json = os.path.join(pkg_dir, "package.json")
    if not os.path.isfile(pkg_json):
        return
    try:
        with open(pkg_json, "r", encoding="utf-8") as fh:
            data = json.load(fh)
    except Exception:
        return
    name = data.get("name")
    version = data.get("version", "")
    if name:
        print(f"{name} {version}")

if os.path.isdir(node_modules):
    for entry in sorted(os.listdir(node_modules)):
        path = os.path.join(node_modules, entry)
        if entry.startswith("@") and os.path.isdir(path):
            for sub in sorted(os.listdir(path)):
                emit(os.path.join(path, sub))
        elif os.path.isdir(path):
            emit(path)
PY
)

declare -A want_names

while IFS='|' read -r pkg version flags registry extra
do
  [ -n "$pkg" ] || continue
  want_names["$pkg"]=1

  installed_ver="${live_ver[$pkg]:-}"
  if [ -n "$installed_ver" ] && [ "$UPDATE" != "1" ]; then
    continue
  fi

  if [ -n "$installed_ver" ] && [ -n "$version" ] && [ "$version" = "$installed_ver" ]; then
    continue
  fi

  spec="$pkg"
  if [ -n "$version" ]; then
    spec="$pkg@$version"
  fi

  args=(add -g "$spec")

  if [ -n "$flags" ]; then
    IFS=',' read -ra FF <<<"$flags"
    for f in "${FF[@]}"; do
      [ -n "$f" ] && args+=("$f")
    done
  fi

  if [ -n "$registry" ]; then
    args+=(--registry "$registry")
  fi

  "$RUN" bun "${args[@]}"
done < <(_emit_norm)

if [ "$ENFORCE" = "1" ] && [ "$UNINSTALL" = "1" ]; then
  echo "== uninstall extras =="
  for pkg in $(printf '%s\n' "${!live_ver[@]}" | sort); do
    if [ -z "${want_names[$pkg]:-}" ]; then
      "$RUN" bun remove -g "$pkg" || true
    fi
  done
fi

if [ -x "$HOME/.local/bin/dotcortex-bun-build-lib" ]; then
  # Source-build rows are processed in the same pass so updates and installs stay sequential.
  # The build fingerprints suppress reruns when the checkout and commands are unchanged.
  source "$HOME/.local/bin/dotcortex-bun-build-lib"

  echo "== bun build pass =="

  seen_build=0
  while IFS=$'\t' read -r name mode root repo ref subdir install_cmd build_cmd health_cmd extra
  do
    [ -n "$name" ] || continue
    if [ -n "$BUN_BUILD_ONLY" ] && [ "$name" != "$BUN_BUILD_ONLY" ]; then
      continue
    fi

    seen_build=1
    bun_build_ensure_checkout "$UPDATE" "$name" "$mode" "$root" "$repo" "$ref"

    root_abs="$(bun_build_root_abs "$root")"
    workdir_abs="$(bun_build_workdir_abs "$root" "$subdir")"
    state_dir="$(bun_build_state_dir "$name")"
    install_stamp="$state_dir/install.fp"
    build_stamp="$state_dir/build.fp"

    install_effective="$(bun_build_effective_install_cmd "$root_abs" "$workdir_abs" "$install_cmd")"
    build_effective="$(bun_build_effective_build_cmd "$build_cmd")"

    if [ -n "$install_effective" ]; then
      install_fp="$(bun_build_install_fingerprint "$root_abs" "$workdir_abs" "$install_effective")"
      if bun_build_fingerprint_matches "$install_stamp" "$install_fp"; then
        echo ">> [$name] install current"
      else
        bun_build_run_step "$name" install "$workdir_abs" "$install_effective"
        bun_build_write_fingerprint "$install_stamp" "$install_fp"
      fi
    else
      echo ">> [$name] install disabled"
    fi

    if [ -n "$build_effective" ]; then
      build_fp="$(bun_build_build_fingerprint "$root_abs" "$workdir_abs" "$install_effective" "$build_effective")"
      if bun_build_fingerprint_matches "$build_stamp" "$build_fp"; then
        echo ">> [$name] build current"
      else
        bun_build_run_step "$name" build "$workdir_abs" "$build_effective"
        bun_build_write_fingerprint "$build_stamp" "$build_fp"
      fi
    else
      echo ">> [$name] build disabled"
    fi
  done < <(bun_build_rows)

  if [ "$seen_build" = "0" ]; then
    echo "No Bun builds defined in $BUN_BUILD_MANIFEST"
  fi
fi

echo "Done."
# Apply manifest inside DotCortex env:1 ends here
