all/.local/bin/bun-health
#!/usr/bin/env bash
# Health

# [[file:../../../bun.org::*Health][Health:1]]
# ~/DotCortex/all/.local/bin/bun-health
set -euo pipefail

"$HOME/.local/bin/dotcortex-bun-env" bash -c '
echo "BUN       = $(command -v bun || echo missing)"
echo "BUNX      = $(command -v bunx || echo missing)"
echo "bun ver   = $(bun --version 2>/dev/null || echo n/a)"
echo "BUN_INSTALL=${BUN_INSTALL:-}"
echo "BUN_GLOBAL_DIR=${BUN_GLOBAL_DIR:-}"
echo "BUN_GLOBAL_BIN_DIR=${BUN_GLOBAL_BIN_DIR:-}"
echo "Global packages: $(python3 - <<"PY"
import json
import os

root = os.path.expanduser(os.environ.get("BUN_GLOBAL_DIR", "~/.bun/install/global"))
node_modules = os.path.join(root, "node_modules")
count = 0
if os.path.isdir(node_modules):
    for entry in os.listdir(node_modules):
        path = os.path.join(node_modules, entry)
        if entry.startswith("@") and os.path.isdir(path):
            count += sum(1 for sub in os.listdir(path) if os.path.isdir(os.path.join(path, sub)))
        elif os.path.isdir(path):
            count += 1
print(count)
PY
)"
'
# Health:1 ends here
