all/.local/bin/bunx-capture
#!/usr/bin/env bash
# Capture managed bunx launchers -> manifest

# [[file:../../../bun.org::*Capture managed bunx launchers -> manifest][Capture managed bunx launchers -> manifest:1]]
# ~/DotCortex/all/.local/bin/bunx-capture
set -euo pipefail

MAN="$HOME/DotCortex/all/.local/share/dotcortex/manifests/bunx/apps.ssv"
BIN_DIR="$HOME/.local/bin"

mkdir -p "$(dirname "$MAN")"
touch "$MAN"

tmp_existing="$(mktemp)"
tmp_have="$(mktemp)"
tmp_new="$(mktemp)"

awk '!/^[[:space:]]*#/ && NF { print $1 }' "$MAN" | sort -u >"$tmp_existing"

python3 - "$BIN_DIR" <<'PY' | sort -u >"$tmp_have"
import os
import sys

bin_dir = os.path.expanduser(sys.argv[1])
if not os.path.isdir(bin_dir):
    raise SystemExit(0)

for name in sorted(os.listdir(bin_dir)):
    path = os.path.join(bin_dir, name)
    if not os.path.isfile(path):
        continue
    try:
        with open(path, "r", encoding="utf-8") as fh:
            lines = fh.readlines()
    except Exception:
        continue
    if any(line.strip() == "# dotcortex:bunx-managed" for line in lines[:8]):
        print(name)
PY

comm -13 "$tmp_existing" "$tmp_have" >"$tmp_new"

rm -f "$tmp_existing" "$tmp_have"

if [ ! -s "$tmp_new" ]; then
  rm -f "$tmp_new"
  echo "No new managed bunx launchers to capture into $MAN"
  exit 0
fi

while read -r name; do
  [ -n "$name" ] || continue
  wrapper="$BIN_DIR/$name"
  pkg="$(awk -F': ' '/^# package:/ { print $2; exit }' "$wrapper")"
  exe="$(awk -F': ' '/^# executable:/ { print $2; exit }' "$wrapper")"
  ver="$(awk -F': ' '/^# version:/ { print $2; exit }' "$wrapper")"
  flags="$(awk -F': ' '/^# flags:/ { print $2; exit }' "$wrapper")"
  printf '%s %s %s "%s" "%s" ""\n' "$name" "${pkg:-$name}" "${exe:-$name}" "${ver:-}" "${flags:-}" >>"$MAN"
done <"$tmp_new"

rm -f "$tmp_new"
echo "Updated $MAN"
# Capture managed bunx launchers -> manifest:1 ends here
