bun.org
* Apply bunx manifest as user launchers
#+BEGIN_SRC bash :tangle all/.local/bin/bunx-apply :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/bunx-apply
set -euo pipefail

MAN="$HOME/DotCortex/all/.local/share/dotcortex/manifests/bunx/apps.ssv"
BIN_DIR="$HOME/.local/bin"

ENFORCE="${ENFORCE:-1}"
UNINSTALL="${UNINSTALL:-1}"

mkdir -p "$BIN_DIR"

echo "== bunx apply =="

_emit_norm() {
  awk -v FS='[ \t]+' '
    function dequote(s){
      if (s == "\"\"") return ""
      if (s ~ /^".*"$/) {
        sub(/^"/, "", s)
        sub(/"$/, "", s)
      }
      return s
    }
    $0 ~ /^[ \t]*#/ || NF==0 { next }
    {
      printf "%s|%s|%s|%s|%s|%s\n",
        dequote($1),dequote($2),dequote($3),dequote($4),dequote($5),dequote($6)
    }
  ' "$MAN"
}

declare -A want_names

while IFS='|' read -r name pkg exe version flags extra
do
  [ -n "$name" ] || continue
  want_names["$name"]=1

  pkg="${pkg:-$name}"
  exe="${exe:-$name}"
  pkgspec="$pkg"
  [ -n "$version" ] && pkgspec="$pkg@$version"

  target="$BIN_DIR/$name"
  tmp="$(mktemp)"

  cat >"$tmp" <<EOF
#!/usr/bin/env bash
# dotcortex:bunx-managed
# name: $name
# package: $pkg
# executable: $exe
# version: $version
# flags: $flags
set -euo pipefail
export BUN_INSTALL="\${BUN_INSTALL:-\$HOME/.bun}"
export PATH="\$BUN_INSTALL/bin:\$PATH"
args=()
pkgspec='$pkgspec'
exe='$exe'
flags_csv='$flags'
if [ -n "\$flags_csv" ]; then
  IFS=',' read -ra FF <<<"\$flags_csv"
  for f in "\${FF[@]}"; do
    [ -n "\$f" ] && args+=("\$f")
  done
fi
exec bunx "\${args[@]}" -p "\$pkgspec" "\$exe" "\$@"
EOF

  chmod +x "$tmp"
  mv "$tmp" "$target"
  echo ">> wrote $target"
done < <(_emit_norm)

if [ "$ENFORCE" = "1" ] && [ "$UNINSTALL" = "1" ]; then
  echo "== remove extras =="
  while read -r name; do
    [ -n "$name" ] || continue
    if [ -z "${want_names[$name]:-}" ]; then
      rm -f "$BIN_DIR/$name"
      echo ">> removed $BIN_DIR/$name"
    fi
  done < <(python3 - "$BIN_DIR" <<'PY'
import os
import sys

bin_dir = os.path.expanduser(sys.argv[1])
if not os.path.isdir(bin_dir):
    raise SystemExit(0)

for name in sorted(os.listdir(bin_dir)):
    path = os.path.join(bin_dir, name)
    if not os.path.isfile(path):
        continue
    try:
        with open(path, "r", encoding="utf-8") as fh:
            lines = fh.readlines()
    except Exception:
        continue
    if any(line.strip() == "# dotcortex:bunx-managed" for line in lines[:8]):
        print(name)
PY
)
fi

echo "Done."
#+END_SRC

* Health for bunx launchers
#+BEGIN_SRC bash :tangle all/.local/bin/bunx-health :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/bunx-health
set -euo pipefail

"$HOME/.local/bin/dotcortex-bun-env" bash -c '
BIN_DIR="$HOME/.local/bin"
echo "BUN       = $(command -v bun || echo missing)"
echo "BUNX      = $(command -v bunx || echo missing)"
echo "Managed wrappers: $(python3 - "$BIN_DIR" <<"PY"
import os
import sys

bin_dir = os.path.expanduser(sys.argv[1])
count = 0
if os.path.isdir(bin_dir):
    for name in os.listdir(bin_dir):
        path = os.path.join(bin_dir, name)
        if not os.path.isfile(path):
            continue
        try:
            with open(path, "r", encoding="utf-8") as fh:
                lines = fh.readlines()
        except Exception:
            continue
        if any(line.strip() == "# dotcortex:bunx-managed" for line in lines[:8]):
            count += 1
print(count)
PY
)"
'
#+END_SRC

* Detach live Bun homes from DotCortex
#+BEGIN_SRC python :tangle all/.local/bin/bun-home-detach :shebang "#!/usr/bin/env python3" :tangle-mode (identity #o755)
from __future__ import annotations

import argparse
import shutil
import sys
from pathlib import Path


SKIP = {"manifest"}


def copy_entry(src: Path, dst: Path) -> None:
    if src.is_dir() and not src.is_symlink():
        shutil.copytree(src, dst, symlinks=True, dirs_exist_ok=True)
    else:
        dst.parent.mkdir(parents=True, exist_ok=True)
        if dst.exists() or dst.is_symlink():
            if dst.is_dir() and not dst.is_symlink():
                shutil.rmtree(dst)
            else:
                dst.unlink()
        shutil.copy2(src, dst, follow_symlinks=False)


def remove_entry(path: Path) -> None:
    if path.is_dir() and not path.is_symlink():
        shutil.rmtree(path)
    elif path.exists() or path.is_symlink():
        path.unlink()


def detach_pair(repo_home: Path, home: Path, keep_repo_copy: bool) -> int:
    if not repo_home.exists():
        return 0
    migrated = 0
    if home.is_symlink():
        home.unlink()
    home.mkdir(parents=True, exist_ok=True)
    for src in sorted(repo_home.iterdir()):
        if src.name in SKIP:
            continue
        copy_entry(src, home / src.name)
        migrated += 1
        if not keep_repo_copy:
            remove_entry(src)
    return migrated


def main() -> int:
    parser = argparse.ArgumentParser(
        description="Detach ~/.bun and ~/.bunx from DotCortex and keep live Bun state in $HOME."
    )
    parser.add_argument(
        "--repo-bun",
        default=str(Path.home() / "DotCortex/all/.bun"),
        help="repo-owned bun path to migrate away from",
    )
    parser.add_argument(
        "--repo-bunx",
        default=str(Path.home() / "DotCortex/all/.bunx"),
        help="repo-owned bunx path to migrate away from",
    )
    parser.add_argument(
        "--bun-home",
        default=str(Path.home() / ".bun"),
        help="real bun home destination",
    )
    parser.add_argument(
        "--bunx-home",
        default=str(Path.home() / ".bunx"),
        help="real bunx home destination",
    )
    parser.add_argument(
        "--keep-repo-copy",
        action="store_true",
        help="do not remove migrated live state from the repo paths",
    )
    args = parser.parse_args()

    migrated_bun = detach_pair(
        Path(args.repo_bun).expanduser().resolve(),
        Path(args.bun_home).expanduser(),
        args.keep_repo_copy,
    )
    migrated_bunx = detach_pair(
        Path(args.repo_bunx).expanduser().resolve(),
        Path(args.bunx_home).expanduser(),
        args.keep_repo_copy,
    )

    print(
        "detached bun homes: "
        f"bun={migrated_bun} bunx={migrated_bunx} "
        f"homes={Path(args.bun_home).expanduser()},{Path(args.bunx_home).expanduser()}"
    )
    return 0


if __name__ == "__main__":
    raise SystemExit(main())
#+END_SRC

* Makefile fragment for Bunx
#+BEGIN_SRC makefile :tangle all/.mk/bunx.mk :padline no
# ~/DotCortex/all/.mk/bunx.mk
.RECIPEPREFIX := |
SHELL := /bin/bash

.PHONY: bunx-capture bunx-diff bunx-sync bunx-apply bunx-health

bunx-capture:
| @chmod +x $(HOME)/.local/bin/bunx-capture 2>/dev/null || true
| $(HOME)/.local/bin/bunx-capture

bunx-diff:
| @chmod +x $(HOME)/.local/bin/bunx-diff 2>/dev/null || true
| $(HOME)/.local/bin/bunx-diff

bunx-sync:
| @chmod +x $(HOME)/.local/bin/bunx-apply 2>/dev/null || true
| ENFORCE=0 UNINSTALL=0 $(HOME)/.local/bin/bunx-apply

bunx-apply:
| @chmod +x $(HOME)/.local/bin/bunx-apply 2>/dev/null || true
| ENFORCE=1 UNINSTALL=1 $(HOME)/.local/bin/bunx-apply

bunx-health:
| @chmod +x $(HOME)/.local/bin/bunx-health 2>/dev/null || true
| $(HOME)/.local/bin/bunx-health
#+END_SRC
