all/.local/bin/bunx-health
#!/usr/bin/env bash
# Health for bunx launchers

# [[file:../../../bun.org::*Health for bunx launchers][Health for bunx launchers:1]]
# ~/DotCortex/all/.local/bin/bunx-health
set -euo pipefail

"$HOME/.local/bin/dotcortex-bun-env" bash -c '
BIN_DIR="$HOME/.local/bin"
echo "BUN       = $(command -v bun || echo missing)"
echo "BUNX      = $(command -v bunx || echo missing)"
echo "Managed wrappers: $(python3 - "$BIN_DIR" <<"PY"
import os
import sys

bin_dir = os.path.expanduser(sys.argv[1])
count = 0
if os.path.isdir(bin_dir):
    for name in os.listdir(bin_dir):
        path = os.path.join(bin_dir, name)
        if not os.path.isfile(path):
            continue
        try:
            with open(path, "r", encoding="utf-8") as fh:
                lines = fh.readlines()
        except Exception:
            continue
        if any(line.strip() == "# dotcortex:bunx-managed" for line in lines[:8]):
            count += 1
print(count)
PY
)"
'
# Health for bunx launchers:1 ends here
